#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=tw1e]
random_id.airflow_webserver_secret: Refreshing state... [id=URkDAKJ0qYw]
random_id.db_user_pass: Refreshing state... [id=Qgw-8UZLpa0]
random_id.suffix: Refreshing state... [id=5Tg3qy2gI_8]
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 1s [id=projects/-/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/wizeline-deb/global/networks/deb-capstone-net]
google_artifact_registry_repository.docker_repository: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/repositories/deb-capstone-airflow-gke]
google_secret_manager_secret.airflow_webserver_secret: Refreshing state... [id=projects/wizeline-deb/secrets/airflow-webserver-secret]
data.google_service_account.deb-sa: Reading...
module.cloudresourcemanager_service.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudresourcemanager.googleapis.com]
data.google_secret_manager_secret_version.airflow_ssh_key_private: Reading...
data.google_client_config.default: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/"wizeline-deb"/regions/"us-central1"/zones/"us-central1-c"]
data.google_service_account.deb-sa: Read complete after 0s [id=projects/wizeline-deb/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
google_secret_manager_secret_version.airflow_webserver_secret_v1: Refreshing state... [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/deb-sub1"]: Refreshing state... [id=projects/wizeline-deb/regions/us-central1/subnetworks/deb-sub1]
module.gke.data.google_container_engine_versions.region: Reading...
google_compute_global_address.private_ip_alloc: Refreshing state... [id=projects/wizeline-deb/global/addresses/private-ip-alloc]
module.gke.data.google_compute_zones.available: Reading...
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/wizeline-deb/serviceAccounts/tf-gke-deb-airflow-clu-tw1e@wizeline-deb.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=wizeline-deb/roles/logging.logWriter/serviceAccount:tf-gke-deb-airflow-clu-tw1e@wizeline-deb.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.airflow_ssh_key_private: Read complete after 1s [id=projects/734911192367/secrets/airflow_ssh_key_private/versions/1]
data.google_secret_manager_secret_version.airflow_webserver_secret: Reading...
google_service_networking_connection.default: Refreshing state... [id=projects%2Fwizeline-deb%2Fglobal%2Fnetworks%2Fdeb-capstone-net:servicenetworking.googleapis.com]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.metricWriter/serviceAccount:tf-gke-deb-airflow-clu-tw1e@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_compute_zones.available: Read complete after 1s [id=projects/wizeline-deb/regions/us-central1]
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.data.google_container_engine_versions.zone: Reading...
module.gke.data.google_container_engine_versions.region: Read complete after 1s [id=2023-09-24 08:41:44.870108077 +0000 UTC]
data.google_secret_manager_secret_version.airflow_webserver_secret: Read complete after 0s [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.viewer/serviceAccount:tf-gke-deb-airflow-clu-tw1e@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.zone: Read complete after 0s [id=2023-09-24 08:41:45.12533268 +0000 UTC]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=wizeline-deb/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-deb-airflow-clu-tw1e@wizeline-deb.iam.gserviceaccount.com]
module.services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=wizeline-deb/iam.googleapis.com]
module.services.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=wizeline-deb/sqladmin.googleapis.com]
module.services.google_project_service.project_services["container.googleapis.com"]: Refreshing state... [id=wizeline-deb/container.googleapis.com]
module.services.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=wizeline-deb/servicenetworking.googleapis.com]
module.services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=wizeline-deb/artifactregistry.googleapis.com]
module.services.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=wizeline-deb/bigquery.googleapis.com]
module.services.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/secretmanager.googleapis.com]
module.services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=wizeline-deb/iamcredentials.googleapis.com]
module.services.google_project_service.project_services["dataproc.googleapis.com"]: Refreshing state... [id=wizeline-deb/dataproc.googleapis.com]
module.services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudbuild.googleapis.com]
module.services.google_project_service.project_services["storage-component.googleapis.com"]: Refreshing state... [id=wizeline-deb/storage-component.googleapis.com]
module.services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=wizeline-deb/compute.googleapis.com]
google_secret_manager_secret.db_user_pass: Refreshing state... [id=projects/wizeline-deb/secrets/db-user-pass-e53837ab2da023ff]
google_secret_manager_secret_version.db_user_pass: Refreshing state... [id=projects/734911192367/secrets/db-user-pass-e53837ab2da023ff/versions/1]
data.google_secret_manager_secret_version.db_user_pass: Reading...
data.google_secret_manager_secret_version.db_user_pass: Read complete after 0s [id=projects/734911192367/secrets/db-user-pass-e53837ab2da023ff/versions/1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # helm_release.airflow will be created
  + resource "helm_release" "airflow" {
      + atomic                     = false
      + chart                      = "airflow"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "airflow"
      + namespace                  = "airflow"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://airflow.apache.org"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.10.0"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # kubernetes_secret.airflow_webserver_secret will be created
  + resource "kubernetes_secret" "airflow_webserver_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "airflow-webserver-secret"
          + namespace        = "airflow"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # null_resource.dependency_setter will be created
  + resource "null_resource" "dependency_setter" {
      + id = (known after apply)
    }

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "deb-airflow-cluster-e53837ab2da023ff"
      + network                     = "projects/wizeline-deb/global/networks/deb-capstone-net"
      + networking_mode             = (known after apply)
      + node_locations              = [
          + "us-central1-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "wizeline-deb"
      + remove_default_node_pool    = false
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/wizeline-deb/regions/us-central1/subnetworks/deb-sub1"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + dns_cache_config {
              + enabled = false
            }
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + gcp_filestore_csi_driver_config {
              + enabled = false
            }
          + gke_backup_agent_config {
              + enabled = false
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + network_policy_config {
              + disabled = true
            }
        }

      + cluster_autoscaling {
          + enabled = false
        }

      + database_encryption {
          + state = "DECRYPTED"
        }

      + default_snat_status {
          + disabled = false
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "deb-sub1-secondary-gke-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "deb-sub1-secondary-gke-services"
          + stack_type                    = "IPV4"
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + network_policy {
          + enabled = false
        }

      + node_pool {
          + initial_node_count          = 0
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = "default-pool"
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = "COS_CONTAINERD"
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + logging_variant   = "DEFAULT"
              + machine_type      = "n1-standard-1"
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = "deb-sa@wizeline-deb.iam.gserviceaccount.com"
              + spot              = false
              + tags              = [
                  + "gke-deb-airflow-cluster-e53837ab2da023ff",
                  + "gke-deb-airflow-cluster-e53837ab2da023ff-default-pool",
                ]
              + taint             = (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }
        }

      + notification_config {
          + pubsub {
              + enabled = false
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + workload_pool = "wizeline-deb.svc.id.goog"
        }
    }

  # module.gke.google_container_node_pool.pools["deb-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "deb-airflow-cluster-e53837ab2da023ff"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "deb-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-central1-c",
        ]
      + operation                   = (known after apply)
      + project                     = "wizeline-deb"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 2
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cluster_name" = "deb-airflow-cluster-e53837ab2da023ff"
              + "node_pool"    = "deb-node-pool"
            }
          + local_ssd_count   = 0
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "cluster_name"             = "deb-airflow-cluster-e53837ab2da023ff"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "deb-node-pool"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = "deb-sa@wizeline-deb.iam.gserviceaccount.com"
          + spot              = false
          + tags              = [
              + "gke-deb-airflow-cluster-e53837ab2da023ff",
              + "gke-deb-airflow-cluster-e53837ab2da023ff-deb-node-pool",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"
        }
    }

  # module.sql-db.google_sql_database.additional_databases["deb-airflow-db"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "deb-sql-instance-e53837ab2da023ff"
      + name            = "deb-airflow-db"
      + project         = "wizeline-deb"
      + self_link       = (known after apply)
    }

  # module.sql-db.google_sql_database.default[0] will be created
  + resource "google_sql_database" "default" {
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "deb-sql-instance-e53837ab2da023ff"
      + name            = "default"
      + project         = "wizeline-deb"
      + self_link       = (known after apply)
    }

  # module.sql-db.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "deb-sql-instance-e53837ab2da023ff"
      + private_ip_address             = (known after apply)
      + project                        = "wizeline-deb"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-central1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = "NOT_REQUIRED"
          + deletion_protection_enabled = false
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + enabled                        = false
              + point_in_time_recovery_enabled = false
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)
            }

          + ip_configuration {
              + allocated_ip_range = "private-ip-alloc"
              + ipv4_enabled       = false
              + private_network    = "https://www.googleapis.com/compute/v1/projects/wizeline-deb/global/networks/deb-capstone-net"
              + require_ssl        = false
            }

          + location_preference {
              + zone = "us-central1-c"
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "canary"
            }
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.sql-db.google_sql_user.additional_users["postgres0"] will be created
  + resource "google_sql_user" "additional_users" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "deb-sql-instance-e53837ab2da023ff"
      + name                    = "postgres0"
      + password                = (sensitive value)
      + project                 = "wizeline-deb"
      + sql_server_user_details = (known after apply)
    }

  # module.sql-db.google_sql_user.default[0] will be created
  + resource "google_sql_user" "default" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "deb-sql-instance-e53837ab2da023ff"
      + name                    = "default"
      + password                = (sensitive value)
      + project                 = "wizeline-deb"
      + sql_server_user_details = (known after apply)
    }

  # module.sql-db.null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "1"
        }
    }

  # module.sql-db.random_password.additional_passwords["postgres0"] will be created
  + resource "random_password" "additional_passwords" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "deb-sql-instance-e53837ab2da023ff"
        }
      + length      = 32
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 0
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.sql-db.random_password.user-password will be created
  + resource "random_password" "user-password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "deb-sql-instance-e53837ab2da023ff"
        }
      + length      = 32
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 0
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/deb-sub1"] will be updated in-place
  ~ resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/wizeline-deb/regions/us-central1/subnetworks/deb-sub1"
        name                       = "deb-sub1"
      ~ private_ip_google_access   = true -> false
        # (11 unchanged attributes hidden)
    }

Plan: 13 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + additional_users          = (sensitive value)
  + gke_cluster_endpoint      = (sensitive value)
  + gke_cluster_name          = (known after apply)
  + instance_connection_name  = (known after apply)
  + private_ip_address        = (known after apply)
  + sql_instance_name         = "deb-sql-instance-e53837ab2da023ff"
  + sql_instance_self_link    = (known after apply)
  + sql_service_account_email = (known after apply)

```

</details>

*Pusher: @uche-madu, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform Workflow`, Pull Request Number: ``*